Repository: marcosjunqueira/sonar-l10n-pt-omegat
Catalog: tm/httpserver-omegat.tmx
Source language: en_us
Languages: pt_br

source: HTTP Server
pt_br: Servidor HTTP

source: Provides infrastructure for testing applets, RMI applications, and so on.
pt_br: Fornece infra-estrutura para o teste de applets, aplicações RMI e assim por diante.

source: The HTTP Server module provides the infrastructure necessary for a variety of tasks, such as testing applets, testing RMI and JINI applications, and viewing Javadoc documentation in the external web browser.
pt_br: O módulo Servidor HTTP fornece a infra-estrutura necessária para uma variedade de tarefas, como o teste de applets, teste de aplicações RMI e JNI, e visualização de documentação Javadoc no browser externo.

source: Embedded HTTP server (not the server for running web applications)
pt_br: Servidor HTTP embutido (não é o servidor usado para executar aplicações web)

source: Selected Hosts:
pt_br: Máquinas selecionadas:

source: Any Host
pt_br: Qualquer máquina

source: Hosts with Granted Access
pt_br: Máquinas com acesso permitido

source: Hosts that are allowed to connect to the HTTP Server.
pt_br: Máquinas que podem se conectar ao Servidor HTTP.

source: Port
pt_br: Porta

source: Port number of the HTTP Server.
pt_br: Número de porta do servidor HTTP.

source: Running
pt_br: Executando

source: If True, the HTTP Server is running.
pt_br: Se 'verdadeiro', então o servidor HTTP está em execução.

source: Show Grant Access Dialog
pt_br: Exibir caixa de diálogo de liberação de acesso

source: If True user is asked to allow access from hosts without granted access.
pt_br: Se 'verdadeiro', o usuário é solicitado para liberar acesso de máquinas sem acesso liberado.

source: If False access is automatically denied.
pt_br: Se 'falso', acesso é recusado automaticamente.

source: You are not authorized to view this page.
pt_br: Você não está autorizado a visualizar esta página.

source: The HTTP server could not start.
pt_br: O servidor HTTP não pôde ser iniciado.

source: There might be another version of Servlet API on the classpath that clashes with version required by this server.
pt_br: Pode haver outra versão da API de Servlets no classpath entrando em choque com a versão requerida pelo servidor.

source: Check that the port is not in use.
pt_br: Verifique se a porta está em uso.

source: Check messages.log for more information.
pt_br: Verifique messages.log para mais informações.

source: Internal HTTP server running on port {0,number,####}
pt_br: Servidor HTTP interno executando na porta {0,number,####}

source: Internal HTTP server stopped
pt_br: Servidor HTTP interno parado

source: In order to perform this action, access to the internal web server from address {0} needs to be enabled.
pt_br: Para realizar esta ação, deve ser habilitado o acesso ao servidor web interno a partir do endereço {0}.

source: Do you wish to enable access from this address?
pt_br: Deseja habilitar o acesso a partir deste endereço?

source: Base servlet for servlets which access IDE Open APIs
pt_br: Servlet base para servlets que acessam as Open APIs do IDE

source: Only root can open port lower than 1024 on UNIX machines.
pt_br: Somente root pode abrir uma porta com número abaixo de 1024 em máquinas UNIX.

source: {0} is not a valid port number.
pt_br: {0} não é um número de porta válido.

source: Servlet for handling IDE Javadoc requests
pt_br: Servlet para tratar requisições Javadoc do IDE

source: Cannot access requested resource.
pt_br: Não é possível acessar o recurso solicitado.

source: &Grant Access to:
pt_br: Li&berar acesso a:

source: Host:
pt_br: Máquina:

source: A&ny Host
pt_br: Qualquer máqui&na

source: &Selected Hosts
pt_br: &Máquinas selecionadas

source: Use this dialog box to specify the machines that are allowed to access the HTTP server.
pt_br: Use esta caixa de diálogo para especificar as máquinas que têm acesso permitido ao servidor HTTP.

source: Select hosts to grant access to.
pt_br: Selecionar as máquinas para permitir o acesso.

source: Host list
pt_br: Lista de máquinas

source: Select a host to grant access to.
pt_br: Selecionar uma máquina para permitir o acesso.

source: Host selection.
pt_br: Seleção de máquina.

source: Select this option to use any host.
pt_br: Selecionar esta opção para usar qualquer máquina.

source: Select this option to use selected hosts.
pt_br: Selecionar está opção para usar as máquinas selecionadas.

source: Grant Access Request
pt_br: Solicitação para permitir acesso

source: &Do Not Show This Dialog Next Time
pt_br: Não exibir esta caixa &de dialogo na proxima vez

source: Do Not Show This Dialog Next Time
pt_br: Não exibir esta caixa de dialogo na próxima vez

source: Start HTTP Server
pt_br: Inicializar servidor HTTP

source: Stop HTTP Server
pt_br: Parar Servidor HTTP

source: Starts internal HTTP Server.
pt_br: Inicializa servidor HTTP interno.

source: Stops internal HTTP Server.
pt_br: Pára servidor HTTP interno.

source: Internal HTTP server is already running.
pt_br: Servidor HTTP interno já está em execução.

source: Internal HTTP server is not running.
pt_br: Servidor HTTP interno não está em execução.

source: Libraries
pt_br: Bibliotecas

source: Servlet 2.2 API Library
pt_br: Biblioteca da API Servlet 2.2
